# 3-2번 문제 --------------------------------------------------------------------------------------

numbers = [273,103,5,32,65,9,72,800,99]

for number in numbers:
    seats = len(str(number))
    print(f"{number}는 {seats}자릿수입니다.")


# 4번 문제 ---------------------------------------------------------------------------------------
numbers04 = [1,2,3,4,5,6,7,8,9]
output = [[],[],[]]

for number in numbers04:
    output[(number +2)%3].append(number)             #****************몰랐으니 계속보자

print(output)

# 5번 문제 ----------------------------------------------------------------------------------------
numbers05 = [1,2,3,4,5,6,7,8,9]

for i in range(0, len(numbers05) // 2):          #0,4
    #j가 1,3,5,7이 나오려면 어떤식을 사용해야할까요?
    j = 1+(2*i)
    print(f"i = {i}, j = {j}")
    numbers05[j] = numbers05[j]**2

print(numbers05)